In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

# NaN not a number

In [3]:
np.nan

nan

In [4]:
type(np.nan)

float

In [5]:
a = 1
b = np.nan

In [6]:
type(a)

int

In [8]:
a+b

nan

In [7]:
type(a+b)

float

In [10]:
1.0 * np.nan

nan

# NaN in Series

In [11]:
s1 = Series([1,2,np.nan,np.nan],index=['A','B','C','C'])

In [12]:
s1

A    1.0
B    2.0
C    NaN
C    NaN
dtype: float64

In [14]:
s1.isnull()

A    False
B    False
C     True
C     True
dtype: bool

In [16]:
s1.notnull()

A     True
B     True
C    False
C    False
dtype: bool

In [17]:
s1.dropna()

A    1.0
B    2.0
dtype: float64

# NaN in DataFrame

In [24]:
df = DataFrame([[1,2,3],[4,np.nan,np.nan],[np.nan,np.nan,np.nan]])

In [25]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  NaN
2  NaN  NaN  NaN

In [27]:
df.isnull()

       0      1      2
0  False  False  False
1  False   True   True
2   True   True   True

In [28]:
df.notnull()

       0      1      2
0   True   True   True
1   True  False  False
2  False  False  False

In [29]:
# 默认参数axis=0,how = 'any' 
df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [30]:
df.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  NaN

In [37]:
df.dropna(axis=1,how='all')

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  NaN
2  NaN  NaN  NaN

In [54]:
# fill with dict/Series column by column
df.fillna(axis=0,value={1:1,2:2})

     0    1    2
0  1.0  2.0  3.0
1  4.0  1.0  2.0
2  NaN  1.0  2.0

In [58]:
# 如上备注以dict/Series赋值不可用于index
df.fillna(axis=1,value=0)

     0    1    2
0  1.0  2.0  3.0
1  4.0  0.0  0.0
2  0.0  0.0  0.0